ИС_СПОРТ_2022/src/Documents/РезультатыСдачиКонтрольноПереводныхНормативов/РезультатыСдачиКонтрольноПереводныхНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыСдачиКонтрольноПереводныхНормативов</name>
  <basedOn>Document.СоревнованиеОФПСдачаНормативов</basedOn>
  <registerRecords>InformationRegister.ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.РезультатыВыполненияПоказателейИНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыСдачиКонтрольноПереводныхНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыПараметровСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.ИтоговыеРезультатыСдачиКонтрольноПереводныхНормативов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПереводаНаЭтап</name>
    <type>
      <types>DocumentRef.ПереводСпортсменовНаЭтап</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группа</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСдачиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторИтоговогоБалла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеБаллыСпортсмена</name>
    <attributes>
      <name>УникальныйИдентификаторИтоговогоБалла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Enums/ТипыРезультатов/ТипыРезультатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРезультатов</name>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Время</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Documents/РезультатыСдачиКонтрольноПереводныхНормативов/Forms/ФормаВводаРезультата/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипРезультата = Параметры.Норматив.ТипРезультата;
	Элементы.РезультатБулево.Видимость = ТипРезультата  = Перечисления.ТипыРезультатов.Булево;
	Элементы.РезультатСтрока.Видимость = ТипРезультата  = Перечисления.ТипыРезультатов.Время;
	Элементы.РезультатЧисло.Видимость  = ТипРезультата  = Перечисления.ТипыРезультатов.Число;
	
	Если ТипРезультата  = Перечисления.ТипыРезультатов.Булево Тогда
		РезультатБулево = ?(Параметры.Результат = Истина, Элементы.РезультатБулево.СписокВыбора[1].Представление,Элементы.РезультатБулево.СписокВыбора[0].Представление);
	ИначеЕсли ТипРезультата  = Перечисления.ТипыРезультатов.Время Тогда
		РезультатСтрока = Параметры.Результат;
	Иначе
		РезультатЧисло = Параметры.Результат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура РезультатСтрокаПриИзменении(Элемент)
	
	Отказ = Ложь;
	УчетСпортсменовОбщегоНазначенияКлиентСервер.ПроверитьРезультатСтроковыйПриИзменении(РезультатСтрока, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Внести(Команда)
	
	СтруктураВозврата = Новый Структура("Результат, РезультатЧисло, РезультатБулево, ТипРезультата");
	СтруктураВозврата.ТипРезультата = ТипРезультата;
	Если ТипРезультата = ПредопределенноеЗначение("Перечисление.ТипыРезультатов.Булево") Тогда
		СтруктураВозврата.Результат = ?(ВРег(РезультатБулево) = "ИСТИНА", "Выполнил", "Не выполнил");
		СтруктураВозврата.РезультатБулево = РезультатБулево;
	ИначеЕсли ТипРезультата = ПредопределенноеЗначение("Перечисление.ТипыРезультатов.Время") Тогда
		
		Отказ = Ложь;
		УчетСпортсменовОбщегоНазначенияКлиентСервер.ПроверитьРезультатСтроковыйПриИзменении(РезультатСтрока,Отказ);
		Если Отказ Тогда
			Возврат
		Иначе	
			СтруктураВозврата.Результат = РезультатСтрока;
			СтруктураВозврата.РезультатЧисло = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяИзСтрокиВМиллесекунды(РезультатСтрока);
		КонецЕсли;
		
	Иначе
		СтруктураВозврата.Результат = РезультатЧисло;
		СтруктураВозврата.РезультатЧисло = РезультатЧисло;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти
